# Data Cleaning with Python

### Import the Libraries

In [1]:
import pandas as pd
import os

### Use pandas to read the CSV file

In [2]:
vgsales = pd.read_csv('vgsales.csv')

### Clean the data

1. Drop any empty rows

In [3]:
vgsales_clean = vgsales.dropna()

2. Drop any duplicate rows

In [4]:
vgsales_clean = vgsales.drop_duplicates()

3. Use the '.describe()' method to get a glimpse of the edited data

In [5]:
vgsales_clean.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

According to the table above, there are roughly 300 values in the column 'Year' that are _null_

In [6]:
vgasales_clean = [vgsales_clean['Year'].isnull()]

We see in the table above, the 'Year' column contains rows that have 'NaN' which the previous dropna method did not pick up. We drop any row containing an 'NaN' value in the year column with the following:

In [7]:
vgsales_clean = vgsales_clean.dropna(subset=['Year'])

In [8]:
vgsales_clean.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16327.000000,16327.000000,16327.000000,16327.000000,16327.000000,16327.000000,16327.000000
mean,8292.868194,2006.406443,0.265415,0.147554,0.078661,0.048325,0.540232
std,4792.669778,5.828981,0.821591,0.508766,0.311557,0.189885,1.565732
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4136.500000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8295.000000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12441.500000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.480000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

### Export the cleaned dataset as a csv locally

In [15]:
vgsales_clean.to_csv('C:\\Users\\justi\\OneDrive\\Desktop\\vgsales_clean', index=False)